#+title: Design and Implementation of the Ari Programming Language
***** Helper functions
Helper functions that will make the code cleaner.
#+begin_src haskell
apply (f, x) = f x
triangle f g = \x -> (f x, g x)
fe1 e1 = \x -> (unR e1 x)
fe2 e2 = \x -> (unR e2 x)

#+end_src

#+begin_src haskell
instance AST R where
  abstraction e1 = R $ curry (unR e1)
  application e1 e2 = R $ apply . (triangle fe1 fe2)
  pair e1 e2 = R $ triangle fe1 fe2
    where
      apply (f, x) = f x
      triangle f g = \x -> (f x, g x)
      fe1 = \x -> (unR e1 x)
      fe2 = \x -> (unR e2 x)


-- T
#+end_src

#+RESULTS:
#+begin_example
ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| ghci| 
<interactive>:451:45-47: error:
    • Couldn't match type ‘env’ with ‘R (h0 -> b) b’
      Expected: env -> (h0 -> b) -> b
        Actual: R (h0 -> b) b -> (h0 -> b) -> b
      ‘env’ is a rigid type variable bound by
        the type signature for:
          application :: forall env a b. R env (a -> b) -> R env a -> R env b
        at <interactive>:451:3-13
    • In the first argument of ‘triangle’, namely ‘fe1’
      In the second argument of ‘(.)’, namely ‘(triangle fe1 fe2)’
      In the second argument of ‘($)’, namely
        ‘apply . (triangle fe1 fe2)’
    • Relevant bindings include
        e2 :: R env a (bound at <interactive>:451:18)
        e1 :: R env (a -> b) (bound at <interactive>:451:15)
        application :: R env (a -> b) -> R env a -> R env b
          (bound at <interactive>:451:3)
#+end_example

# ** Applicationa
on
Let's start with application, application takes two terms, the first one a function and the second term you apply it to create a third term.
In tagless-final paper it's:

#+begin_src haskell
apply = 
type Function = (->)
instance Expr Function where
  application a b = apply  (\h -> triangle (a h) (b h))
  -- a
#+end_src



#+begin_src haskell
instance AST R where
  abstraction e1 e2 = apply
#+end_src


